Repository: CM-9xx/cm9xx
Catalog: trunk/processing-head/app/src/processing/app/Resources_*.po
Languages: de, zh_tw

source: No files were added to the sketch.
de: Es wurden keine Dateien zum Sketch hinzugefügt.
zh_tw: 並沒有檔案加入草稿碼

source: One file added to the sketch.
de: Eine Datei wurde zum Sketch hinzugefügt.
zh_tw: 一個檔案加入草稿碼

source: {0} files added to the sketch.
de: {0} Dateien wurden zum Sketch hinzugefügt.
zh_tw: {0}個檔案加入草稿碼

source: File
de: Datei
zh_tw: 檔案

source: New
de: Neu
zh_tw: 新增

source: Open...
de: Öffnen...
zh_tw: 開啟...

source: Examples
de: Beispiele
zh_tw: 範例

source: Close
de: Schließen
zh_tw: 關閉

source: Save
de: Speichern
zh_tw: 儲存

source: Save As...
de: Speichern unter...
zh_tw: 另存新檔...

source: Upload Using Programmer
de: Upload mit Programmer
zh_tw: 以燒錄器上傳

source: Page Setup
de: Papierformat
zh_tw: 頁面設定

source: Print
de: Drucken
zh_tw: 列印

source: Preferences
de: Einstellungen
zh_tw: 偏好設定

source: Quit
de: Beenden
zh_tw: 離開

source: Verify / Compile
de: Überprüfen / Kompilieren
zh_tw: 驗證∕編譯

source: Import Library...
de: Library importieren...
zh_tw: 匯入程式庫...

source: Show Sketch Folder
de: Sketchordner anzeigen
zh_tw: 顯示草稿碼的所在目錄

source: Add File...
de: Datei hinzufügen...
zh_tw: 加入檔案...

source: Serial Port
de: Serieller Port
zh_tw: 序列埠

source: Burn Bootloader
de: Bootloader installieren
zh_tw: 燒錄bootloader

source: serialMenu is null
de: serialMenu ist leer
zh_tw: 序列埠的選單是空的

source: name is null
de: name ist leer
zh_tw: 名稱是空的

source: error retrieving port list
de: Fehler beim Holen der Portliste
zh_tw: 取得序列埠列表時發生錯誤

source: Help
de: Hilfe
zh_tw: 說明

source: Getting Started
de: Erste Schritte
zh_tw: 入門手冊

source: Environment
de: Umgebung
zh_tw: 開發環境

source: Troubleshooting
de: Fehlersuche
zh_tw: 排除問題

source: Reference
de: Referenz
zh_tw: 參考文件

source: Find in Reference
de: In Referenz suchen
zh_tw: 在參考文件裡尋找

source: Frequently Asked Questions
de: Häufig gestellte Fragen
zh_tw: 常見問答集

source: Visit Arduino.cc
de: Arduino.cc besuchen
zh_tw: 拜訪Arduino.cc

source: About Arduino
de: Über Arduino
zh_tw: 關於Arduino

source: Edit
de: Bearbeiten
zh_tw: 編輯

source: Undo
de: Rückgängig
zh_tw: 復原

source: Redo
de: Wiederholen
zh_tw: 重複

source: Cut
de: Ausschneiden
zh_tw: 剪下

source: Copy
de: Kopieren
zh_tw: 複製

source: Copy for Forum
de: Für Forum kopieren
zh_tw: 為了論壇進行複製

source: Copy as HTML
de: Als HTML kopieren
zh_tw: 當做HTML進行複製

source: Paste
de: Einfügen
zh_tw: 貼上

source: Select All
de: Alles auswählen
zh_tw: 全選

source: Comment/Uncomment
de: Kommentieren
zh_tw: 註解∕移除註解

source: Increase Indent
de: Einrücken
zh_tw: 增加縮排深度

source: Decrease Indent
de: Ausrücken
zh_tw: 減少縮排深度

source: Find...
de: Suchen...
zh_tw: 尋找...

source: Find Next
de: Nächstes finden
zh_tw: 找下一個

source: Find Previous
de: Vorheriges finden
zh_tw: 找上衣個

source: Use Selection For Find
de: Auswahl zum Suchen verwenden
zh_tw: 以選取字串進行尋找

source: First select a word to find in the reference.
de: Selektieren Sie erst ein Wort, um es in der Referenz zu finden.
zh_tw: 請先選擇字串，再到參考文件裡尋找。

source: No reference available for "{0}"
de: Keine Referenz verfügbar für "{0}"
zh_tw: 關於"{0}"沒有參考文件

source: Compiling sketch...
de: Sketch kompilieren...
zh_tw: 編譯草稿碼...

source: Done compiling.
de: Kompilierung abgeschlossen.
zh_tw: 編譯完成

source: Save changes to "{0}"?
de: Änderungen an "{0}" speichern?
zh_tw: 將更動處儲存到"{0}"？

source: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Do you want to save changes to this sketch<BR> before closing?</b><p>If you don't save, your changes will be lost.
de: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Möchten Sie Ihre Änderungen an diesem Sketch speichern, bevor Arduino geschlossen wird?</b><p>Wenn Sie die Datei nicht speichern, sind alle Änderungen verloren.
zh_tw: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>你想在關閉草稿碼前儲存變更的地方嗎？<BR></b><p>若不儲存，將會遺失變更的地方。

source: Cancel
de: Abbruch
zh_tw: 取消

source: Don't Save
de: Nicht speichern
zh_tw: 不儲存

source: Bad file selected
de: Ungültige Datei ausgewählt
zh_tw: 選擇了不對的檔案

source: Processing can only open its own sketches and other files ending in .ino or .pde
de: Arduino kann nur seine eigenen Sketche und andere Dateien mit der Dateiendung .ino oder .pde öffnen
zh_tw: Processing只能開啟它自己的草稿碼， 以及其他.ino或.pde的檔案。

source: The file "{0}" needs to be inside a sketch folder named "{1}". Create this folder, move the file, and continue?
de: Die Datei "{0}" muss sich innerhalb eines Sketchordners mit dem Namen "{1}" befinden. Ordner erstellen, die Datei verschieben und fortfahren?
zh_tw: 檔案"{0}"必須放在名為"{1}"的 草稿碼目錄中。 建立這個目錄、移動檔案、然後繼續？

source: Moving
de: Verschieben
zh_tw: 移動中

source: Error
de: Fehler
zh_tw: 錯誤

source: A folder named "{0}" already exists. Can't open sketch.
de: Ein Ordner mit dem Namen "{0}" existiert bereits. Der Sketch kann nicht geöffnet werden.
zh_tw: 名為"{0}"的目錄已經存在，無法開啟草稿碼。

source: Could not create the sketch folder.
de: Der Sketchordner konnte nicht erstellt werden.
zh_tw: 無法建立草稿碼目錄

source: Could not copy to a proper location.
de: Konnte die Datei nicht an einen geeigneten Ort kopieren.
zh_tw: 無法複製到適當的位置

source: Could not create the sketch.
de: Der Sketch konnte nicht erstellt werden.
zh_tw: 無法建立草稿碼

source: Saving...
de: Speichern...
zh_tw: 儲存中...

source: Done Saving.
de: Gespeichert.
zh_tw: 儲存完畢

source: Save Canceled.
de: Speichern abgebrochen.
zh_tw: 儲存動作被取消了

source: Serial port {0} not found. Retry the upload with another serial port?
de: Der serielle Port {0} wurde nicht gefunden. Mit einem anderen Port erneut versuchen?
zh_tw: 找不到序列埠{0}， 以另一個序列埠重新嘗試上傳嗎？

source: Uploading to I/O Board...
de: Upload zum I/O Board...
zh_tw: 上傳到I/O板子中...

source: Done uploading.
de: Upload abgeschlossen.
zh_tw: 上傳完畢

source: Upload canceled.
de: Upload abgebrochen.
zh_tw: 上傳動作被取消了

source: Save changes before export?
de: Änderungen vor dem Export speichern?
zh_tw: 匯出前儲存變更的地方？

source: Export canceled, changes must first be saved.
de: Export wurde abgebrochen, die Änderungen müssen erst gespeichert werden.
zh_tw: 匯出動作被取消了，變更的地方必須先儲存。

source: Burning bootloader to I/O Board (this may take a minute)...
de: Bootloader wird auf dem I/O Board installiert (das kann eine Weile dauern)...
zh_tw: 將bootloader燒錄到I/O板子裡（可能需要一點時間）...

source: Done burning bootloader.
de: Bootloader wurde installiert.
zh_tw: 燒錄bootloader完畢

source: Error while burning bootloader.
de: Fehler beim Installieren des Bootloaders.
zh_tw: 燒錄bootloader時發生錯誤

source: Printing...
de: Drucken...
zh_tw: 列印...

source: Done printing.
de: Gedruckt.
zh_tw: 列印完畢

source: Error while printing.
de: Fehler beim Drucken.
zh_tw: 列印時發生錯誤

source: Printing canceled.
de: Drucken wurde abgebrochen.
zh_tw: 列印動作被取消了

source: Bad error line: {0}
de: Schlechte Fehlerzeile: {0}
zh_tw: 不對的行數：{0}

source: Open URL
de: URL öffnen
zh_tw: 開啟URL

source: A new version of Arduino is available, would you like to visit the Arduino download page?
de: Es ist eine neue Version von Arduino verfügbar, möchten Sie die Arduino Download-Seite besuchen?
zh_tw: Arduino有新版本了， 你想要開啟Arduino的下載頁面嗎？

source: Yes
de: Ja
zh_tw: 是

source: No
de: Nein
zh_tw: 否

source: Find:
de: Suchen:
zh_tw: 尋找：

source: Replace with:
de: Ersetzen mit:
zh_tw: 取代為：

source: Ignore Case
de: Groß- und Kleinschreibung ignorieren
zh_tw: 忽略大小寫

source: Wrap Around
de: Umschließen
zh_tw: 包裹起來

source: Replace All
de: Alle ersetzen
zh_tw: 全部取代

source: Replace
de: Ersetzen
zh_tw: 取代

source: Replace & Find
de: Ersetzen & Suchen
zh_tw: 取代&尋找

source: Previous
de: Vorheriges
zh_tw: 前一個

source: Find
de: Suchen
zh_tw: 尋找

source: Send
de: Senden
zh_tw: 傳送

source: Autoscroll
de: Automatisch scrollen
zh_tw: 自動捲動

source: No line ending
de: Kein Zeilenende
zh_tw: 沒有行結尾

source: Newline
de: Neue Zeile (NL)
zh_tw: NL(newline)

source: Carriage return
de: Zeilenumbruch (CR)
zh_tw: CR(carriage return)

source: Both NL & CR
de: Sowohl NL als auch CR
zh_tw: NL與CR

source: Serial port ''{0}'' already in use. Try quiting any programs that may be using it.
de: Der serielle Port ''{0}'' wird bereits verwendet. Probieren Sie, andere Programme zu beenden, die ihn benutzen könnten.
zh_tw: 序列埠''{0}''處於使用狀態中，請試著關閉可能正在使用序列埠的軟體

source: Error opening serial port ''{0}''.
de: Fehler beim Öffnen des seriellen Ports ''{0}''.
zh_tw: 開啟序列埠''{0}''時發生錯誤

source: Serial port ''{0}'' not found. Did you select the right one from the Tools > Serial Port menu?
de: Der serielle Port ''{0}'' wurde nicht gefunden. Haben Sie den richtigen aus dem Menü Tools > Serieller Port ausgewählt?
zh_tw: 找不到序列埠''{0}''，在「工具 > 序列埠」選單裡，你選的序列埠正確嗎？

source: readBytesUntil() byte buffer is too small for the {0} bytes up to and including char {1}
de: Der readBytesUntil() Byte Puffer ist zu klein für die {0} Bytes bis einschließlich char {1}
zh_tw: readBytesUntil()的位元組緩衝區太小，不能容納{0} bytes，直到char {1}（包含）

source: Error inside Serial.{0}()
de: Fehler in Serial.{0}()
zh_tw: 在Serial.{0}()裡發生錯誤

source: Auto Format
de: Automatisch formatieren
zh_tw: 自動格式化

source: No changes necessary for Auto Format.
de: Es sind keine Änderungen für automatisches Formatieren nötig.
zh_tw: 自動格式化沒有需要變更的地方

source: Auto Format Canceled: Too many right parentheses.
de: Automatische Formatierung wurde abgebrochen: Zu viele schließende Klammern
zh_tw: 自動格式化被取消了：太多右括號

source: Auto Format Canceled: Too many left parentheses.
de: Automatische Formatierung wurde abgebrochen: Zu viele öffnende Klammern
zh_tw: 自動格式化被取消了：太多左括號

source: Auto Format Canceled: Too many right curly braces.
de: Automatische Formatierung wurde abgebrochen: Zu viele schließende geschweifte Klammern
zh_tw: 自動格式化被取消了：太多右大括號

source: Auto Format Canceled: Too many left curly braces.
de: Automatische Formatierung wurde abgebrochen: Zu viele öffnende geschweifte Klammern
zh_tw: 自動格式化被取消了：太多左大括號

source: Auto Format finished.
de: Automatische Formatierung abgeschlossen.
zh_tw: 自動格式化完畢

source: Fix Encoding & Reload
de: Kodierung reparieren & neu laden
zh_tw: 修正編碼並重新載入

source: Discard all changes and reload sketch?
de: Alle Änderungen verwerfen und Sketch neu laden?
zh_tw: 放棄所有變更並重新載入草稿碼？

source: An error occurred while trying to fix the file encoding. Do not attempt to save this sketch as it may overwrite the old version. Use Open to re-open the sketch and try again.
de: Es ist ein Fehler beim Reparieren der Dateikodierung aufgetreten. Versuchen Sie nicht, diesen Sketch zu speichern, nweil es die alte Version überschreiben könnte. Verwenden Sie "Öffnen", um den Sketch neu zu öffnen und versuchen Sie es erneut.
zh_tw: 試著修正檔案編碼時發生錯誤。 請不要試著儲存這份草稿碼，可能會覆蓋舊版本。 請用「開啟」重新開啟草稿碼再試一次。

source: Archive Sketch
de: Sketch archivieren
zh_tw: 封存草稿碼

source: Couldn't archive sketch
de: Sketch konnte nicht archiviert werden
zh_tw: 無法封存草稿碼

source: Archiving the sketch has been canceled because the sketch couldn't save properly.
de: Die Archivierung des Sketches wurde abgebrochen, weil der Sketch nicht korrekt gespeichert werden konnte.
zh_tw: 草稿碼封存動作被取消了 ，因為無法適當地儲存草稿碼。

source: Archive sketch as:
de: Sketch archivieren als:
zh_tw: 將草稿碼封存為：

source: Archive sketch canceled.
de: Archivierung des Sketches wurde abgebrochen.
zh_tw: 草稿碼封存動作被取消了

source: Error while loading code {0}
de: Fehler beim Laden des Codes {0}
zh_tw: 載入程式碼{0}時發生錯誤

source: "{0}" contains unrecognized characters.If this code was created with an older version of Processing,you may need to use Tools -> Fix Encoding & Reload to updatethe sketch to use UTF-8 encoding. If not, you may need todelete the bad characters to get rid of this warning.
de: "{0}" enthält fehlerhafte Zeichen. Wenn dieser Code mit einer älteren Version von Arduino erstellt worden war, könnte es notwendig sein, Tools > Kodierung reparieren & neu laden zu benutzen, um den Sketch in UTF-8 zu konvertieren. Wenn nicht, sollten Sie die schlechten Zeichen löschen, um die Meldung loszuwerden.
zh_tw: "{0}"含有無法辨識的字元。若這份程式是以舊版Processing建立的話，你需要以「工具 -> 修正編碼並重新載入」將草稿碼更新為UTF-8編碼格式，若不想這麼做的話，請刪除不正確的字元，以免除此警告訊息。

source: Sketch is Read-Only
de: Sketch ist schreibgeschützt
zh_tw: 草稿碼為唯讀狀態

source: Some files are marked "read-only", so you'll need to re-save the sketch in another location, and try again.
de: Einige Dateien wurden als schreibgeschützt markiert, also müssen Sie den Sketch woanders speichern und es erneut versuchen.
zh_tw: 有些檔案為"唯讀"，你必須將草稿碼重新儲存到別的位置，然後重試。

source: Name for new file:
de: Name für neue Datei:
zh_tw: 新檔案命名：

source: Sketch is Untitled
de: Sketch hat keinen Namen
zh_tw: 草稿碼沒有名稱

source: How about saving the sketch first before trying to rename it?
de: Wie wäre es, den Sketch erst zu speichern, bevor Sie versuchen, ihn umzubenennen?
zh_tw: 改名草稿碼之前， 要不要先儲存？

source: Problem with rename
de: Problem beim Umbenennen
zh_tw: 改名時發生問題

source: The name cannot start with a period.
de: Der Name darf nicht mit einem Punkt anfangen.
zh_tw: 名稱不能以句點「.」開頭

source: ".{0}" is not a valid extension.
de: ".{0}" ist keine gültige Dateiendung.
zh_tw: ".{0}"為無效的附檔名

source: The main file can't use an extension. (It may be time for your to graduate to a "real" programming environment)
de: Die Hauptdatei kann keine Dateiendung benutzen. (Es wird Zeit, dass Sie einen Abschluss für eine "richtige" Programmierumgebung machen)
zh_tw: 主要檔案不能使用附檔名。 （對你來說，這似乎是個升級到 "真實的"程式開發環境的好時機）

source: Nope
de: Nee
zh_tw: 不要

source: A file named "{0}" already exists in "{1}"
de: Eine Datei mit dem Namen "{0}" existiert bereits in "{1}".
zh_tw: 在"{1}"裡已經存在名為"{0}"的檔案

source: You can't have a .cpp file with the same name as the sketch.
de: Sie können keine .cpp-Datei mit dem selben Namen wie der Sketch erstellen.
zh_tw: .cpp檔案的檔名不能跟草稿碼名稱相同

source: You can't rename the sketch to "{0}" because the sketch already has a .cpp file with that name.
de: Sie können den Sketch nicht zu "{0}" umbenennen, weil der Sketch bereits eine .cpp-Datei mit diesem Namen hat.
zh_tw: 你不能將草稿碼改名為"{0}" ，因為那個名字已經有個.cpp檔案了

source: Cannot Rename
de: Kann nicht umbenennen
zh_tw: 無法重新命名

source: Sorry, a sketch (or folder) named "{0}" already exists.
de: Sorry, ein Sketch (oder Ordner) mit dem Namen "{0}" existiert bereits.
zh_tw: 抱歉，已經存在名為"{0}"的草稿碼（或目錄）

source: Could not rename the sketch. (0)
de: Der Sketch konnte nicht umbenannt werden. (0)
zh_tw: 無法重新命名草稿碼。(0)

source: Could not rename "{0}" to "{1}"
de: "{0}" konnte nicht zu "{1}" umbenannt werden
zh_tw: 無法將"{0}"重新命名為"{1}"

source: Could not rename the sketch. (1)
de: Der Sketch konnte nicht umbenannt werden. (1)
zh_tw: 無法重新命名草稿碼。(1)

source: Could not rename the sketch. (2)
de: Der Sketch konnte nicht umbenannt werden. (2)
zh_tw: 無法重新命名草稿碼。(2)

source: createNewFile() returned false
de: createNewFile() hat false zurückgegeben
zh_tw: createNewFile()回傳false

source: Are you sure you want to delete this sketch?
de: Sind Sie sicher, dass Sie diesen Sketch löschen möchten?
zh_tw: 確定要刪除這個草稿碼？

source: Are you sure you want to delete "{0}"?
de: Sind Sie sicher, dass Sie "{0}" löschen möchten?
zh_tw: 你確定想要刪除"{0}"？

source: Delete
de: Löschen
zh_tw: 刪除

source: Couldn't do it
de: Konnte nicht gemacht werden
zh_tw: 無法執行

source: Could not delete "{0}".
de: Konnte "{0}" nicht löschen.
zh_tw: 無法刪除"{0}"

source: removeCode: internal error.. could not find code
de: removeCode: interner Fehler.. Konnte Code nicht finden
zh_tw: removeCode：內部錯誤..找不到程式碼

source: Sketch is read-only
de: Sketch ist schreibgeschützt
zh_tw: 草稿碼為唯讀狀態

source: Some files are marked "read-only", so you'll need to re-save this sketch to another location.
de: Einige Dateien wurden als "Read-Only" markiert, also müssen Sie sie den Sketch an einem anderen Speicherort speichern und es erneut versuchen
zh_tw: 有些檔案為"唯讀"，你必須將草稿碼重新儲存到別的位置。

source: In Arduino 1.0, the default file extension has changed from .pde to .ino. New sketches (including those created by "Save-As" will use the new extension. The extension of existing sketches will be updated on save, but you can disable this in the Preferences dialog. Save sketch and update its extension?
de: In Arduino 1.0 hat sich die Standard-Dateiendung von .pde zu .ino geändert. Neue Sketche (inklusive diese, die über "Speichern unter" erstellt worden sind) verwenden diese neue Endung. Die Endung von existierenden Sketchen wird beim Speichern geändert, dieses Verhalten kann jedoch in den Einstellungen geändert werden. Sketch speichern und Endung anpassen?
zh_tw: 在Arduino 1.0裡，預設附檔名已經從 .pde改為.ino，新的草稿碼（包括以「另存新檔」建立的）， 都會使用新的附檔名。已經存在的草稿碼的附檔名， 將會在儲存時被更新，但你可以在偏好設定裡 關閉這個動作。 儲存草稿碼並更新附檔名？

source: Save sketch folder as...
de: Sketchordner speichern als...
zh_tw: 將草稿碼目錄儲存為...

source: You can't save the sketch as "{0}" because the sketch already has a .cpp file with that name.
de: Sie können den Sketch nicht zu "{0}" umbenennen, weil der Sketch bereits eine .cpp-Datei mit diesem Namen hat.
zh_tw: 你不能將草稿碼儲存為"{0}" ，因為已經有個擁有相同名稱的.cpp檔案了。

source: How very Borges of you
de: Uh oh

source: You cannot save the sketch into a folder inside itself. This would go on forever.
de: Sie können den Sketch nicht in einen Ordner in sich selbst abspeichern. Das würde immer so weiter gehen.
zh_tw: 你不能將草稿碼儲存在它自己的目錄裡， 這會沒完沒了。

source: Select an image or other data file to copy to your sketch
de: Wählen Sie ein Bild oder eine andere Datei zum Kopieren in ihren Sketch
zh_tw: 選擇影像檔或其他資料檔案，複製到你的草稿碼裡

source: Replace the existing version of {0}?
de: Existierende Version von {0} ersetzen?
zh_tw: 取代{0}的已存在版本

source: Error adding file
de: Fehler beim Hinzufügen der Datei
zh_tw: 加入檔案時發生錯誤

source: Could not delete the existing ''{0}'' file.
de: Konnte die existierende Datei ''{0}'' nicht löschen.
zh_tw: 無法刪除現存的''{0}''檔案

source: You can't fool me
de: Du kannst mir nichts vormachen
zh_tw: 你騙不了我的

source: This file has already been copied to the location from which where you're trying to add it. I ain't not doin nuthin'.
de: Diese Datei wurde bereits zu dem Speicherort hinzugefügt, von dem Sie sie versuchen, hinzuzufügen. Ich tue einfach mal nichts.
zh_tw: 你正試著加入這支檔案， 但檔案已經被複製到該處了。 I ain't not doin nuthin'.

source: Could not add ''{0}'' to the sketch.
de: ''{0}'' konnte nicht zum Sketch hinzugefügt werden.
zh_tw: 無法將''{0}''加入到草稿碼裡

source: Build folder disappeared or could not be written
de: Der Build-Ordner ist verschwunden, oder konnte nicht geschrieben werden
zh_tw: 建置目錄不見了，或是無法寫入

source: Could not find main class
de: Die Hauptklasse wurde nicht gefunden
zh_tw: 找不到主類別

source: Uncaught exception type: {0}
de: Nicht abgefangener Exception-Typ: {0}

source: Problem moving {0} to the build folder
de: Problem beim Verschieben von {0} in den Build-Ordner
zh_tw: 將{0}移動到建置目錄裡時發生問題

source: Uploading...
de: Uploaden...
zh_tw: 上傳中...

source: Binary sketch size: {0} bytes (of a {1} byte maximum)
de: Binäre Sketchgröße: {0} Bytes (von einem Maximum von {1} Bytes)
zh_tw: 草稿碼二進位的大小：{0} bytes（上限為{1} bytes）

source: Couldn't determine program size: {0}
de: Programmgröße konnte nicht festgestellt werden: {0}
zh_tw: 無法判斷程式大小：{0}

source: Sketch too big; see http://www.arduino.cc/en/Guide/Troubleshooting#size for tips on reducing it.
de: Sketch zu groß; siehe http://www.arduino.cc/en/Guide/Troubleshooting#size für Tipps zum Verkleinern.
zh_tw: 草稿碼太大了；縮減技巧請見http://www.arduino.cc/en/Guide/Troubleshooting#size

source: Missing the */ from the end of a /* comment */
de: */ fehlt bei einem Ende eines /* Kommentars */
zh_tw: 有個/*註解*/，但沒有*/作為結尾

source: Sketch Disappeared
de: Sketch ist verschwunden
zh_tw: 草稿碼消失了

source: The sketch folder has disappeared. Will attempt to re-save in the same location, but anything besides the code will be lost.
de: Der Sketch-Ordner ist verschwunden. Es wird versucht, am selben Speicherort zu speichern, aber alles außer dem Code wird verloren sein.
zh_tw: 草稿碼目錄消失了。 將試著在同樣的位置重新儲存， 但是，程式碼以外的東西將會遺失。

source: Could not re-save sketch
de: Sketch konnte nicht gespeichert werden.
zh_tw: 無法重新儲存草稿碼

source: Could not properly re-save the sketch. You may be in trouble at this point, and it might be time to copy and paste your code to another text editor.
de: Der Sketch konnte nicht korrekt gespeichert werden. Das könnte für Sie Probleme bedeuten und es wäre nun Zeit, den Code per Copy und Paste in einen anderen Texteditor zu übernehmen.
zh_tw: 無法適當地重新儲存草稿碼，此時應該會出問題， 請將你的程式複製貼上到別的文字編輯器裡。

source: The sketch name had to be modified. Sketch names can only consist of ASCII characters and numbers (but cannot start with a number). They should also be less less than 64 characters long.
de: Der Sketchname musste geändert werden. Sketchnamen können nur ASCII-Zeichen und Zahlen enthalten (aber können nicht mit einer Zahl beginnen). Außerdem sollten Sie kürzer sein als 64 Zeichen.
zh_tw: 草稿碼名稱被變更了。草稿碼名稱只能含有ASCII字元與數字 （但不能以數字開頭）。 名稱必須少於64個字元。

source: Compiler error, please submit this code to {0}
de: Compiler-Fehler, bitte übermitteln Sie diesen Code zu {0}
zh_tw: 編譯錯誤，請將這個碼提交給{0}

source: the selected serial port {0} does not exist or your board is not connected
de: Der ausgewählte serielle Port {0} existiert nicht oder das Board ist nicht verbunden
zh_tw: 你選擇的序列埠{0}不存在，或是你的板子尚未連接。

source: Device is not responding, check the right serial port is selected or RESET the board right before exporting
de: Das Gerät antwortet nicht, überprüfen Sie, ob der richtige serielle Port ausgewählt ist oder führen Sie einen RESET auf dem Board direkt vor dem Export durch.
zh_tw: 裝置沒有回應，請確認選擇的序列埠是否正確，或是在匯出之前立即RESET重置板子

source: Problem uploading to board. See http://www.arduino.cc/en/Guide/Troubleshooting#upload for suggestions.
de: Problem beim Uploaden zum Board. Beachten Sie http://www.arduino.cc/en/Guide/Troubleshooting#upload für Lösungsvorschläge.
zh_tw: 上傳到板子裡時發生問題，請見http://www.arduino.cc/en/Guide/Troubleshooting#upload尋找解決方法

source: Wrong microcontroller found. Did you select the right board from the Tools > Board menu?
de: Es wurde ein falscher Microcontroller gefunden. Haben Sie den richtigen aus dem Menü Tools > Board ausgewählt?
zh_tw: 找到不對的微處理器，你在「工具 > 板子」選單裡選對板子了嗎？

source: No board selected; please choose a board from the Tools > Board menu.
de: Es wurde kein Board ausgewählt; bitte wählen Sie ein Board aus dem Menü Tools > Board.
zh_tw: 沒有選擇板子；請從「工具 > 板子」選擇板子

source: {0} returned {1}
de: {0} hat {1} zurückgegeben
zh_tw: {0}回傳{1}

source: Error compiling.
de: Fehler beim Kompilieren.
zh_tw: 編譯出錯

source: Please import the SPI library from the Sketch > Import Library menu.
de: Bitte importieren Sie die SPI Library aus dem Menü Sketch > Library importieren.
zh_tw: 請從「草稿碼 > 匯入程式庫」選單匯入SPI程式庫

source: As of Arduino 0019, the Ethernet library depends on the SPI library. You appear to be using it or another library that depends on the SPI library.
de: Seit Arduino 0019 hängt die Ethernet Library von der SPI Library ab. Es scheint so, als würden Sie diese oder eine andere Library verwenden, die die SPI Library benötigt.
zh_tw: 從Arduino 0019開始，Ethernet程式庫相依於SPI程式庫。 你似乎正在使用相依於SPI的Ethernet或其他程式庫。

source: The 'BYTE' keyword is no longer supported.
de: Das Keyword 'BYTE' wird nicht mehr unterstützt.
zh_tw: 不再支援關鍵字'BYTE'

source: As of Arduino 1.0, the 'BYTE' keyword is no longer supported. Please use Serial.write() instead.
de: Seit Arduino 1.0 wird das Keyword 'BYTE' nicht mehr unterstützt. Bitte verwenden Sie stattdessen Serial.write().
zh_tw: 從Arduino 1.0開始，不再支援關鍵字'BYTE'。 請改用Serial.write()。

source: The Server class has been renamed EthernetServer.
de: Die Klasse Server wurde zu EthernetServer umbenannt.
zh_tw: 類別Server已經改名為EthernetServer

source: As of Arduino 1.0, the Server class in the Ethernet library has been renamed to EthernetServer.
de: Seit Arduino 1.0 wurde die Klasse Server zu EthernetServer umbenannt.
zh_tw: 從Arduino 1.0開始，Ethernet程式庫的Server類別已經改名為EthernetServer。

source: The Client class has been renamed EthernetClient.
de: Die Klasse Client wurde zu EthernetClient umbenannt.
zh_tw: 類別Client已經改名為EthernetClient。
