Repository: CM-9xx/cm9xx
Catalog: trunk/processing-head/app/src/processing/app/Resources_*.po
Languages: de, zh_tw

source: As of Arduino 1.0, the Client class in the Ethernet library has been renamed to EthernetClient.
de: Seit Arduino 1.0 wurde die Klasse Client zu EthernetClient umbenannt.
zh_tw: 從Arduino 1.0開始，Ethernet程式庫的Client類別已經改名為EthernetClient。

source: The Udp class has been renamed EthernetUdp.
de: Die Klasse Udp wurde zu EthernetUdp umbenannt.
zh_tw: 類別Udp已經改名為EthernetUdp。

source: As of Arduino 1.0, the Udp class in the Ethernet library has been renamed to EthernetClient.
de: Seit Arduino 1.0 wurde die Klasse Udp in der Ethernet Library zu EthernetClient umbenannt.

source: Wire.send() has been renamed Wire.write().
de: Wire.send() wurde zu Wire.write() umbenannt.
zh_tw: Wire.send()已經改名為Wire.write()。

source: As of Arduino 1.0, the Wire.send() function was renamed to Wire.write() for consistency with other libraries.
de: Seit Arduino 1.0 wurde die Funktion Wire.send() wegen der Übereinstimmung mit anderen Librarys zu Wire.write() umbenannt.
zh_tw: 從Arduino 1.0開始，Wire.send()函式已經改名為Wire.wirte()，以便與其他程式庫保持一致。

source: Wire.receive() has been renamed Wire.read().
de: Wire.receive() wurde zu Wire.read() umbenannt.
zh_tw: Wire.receive()已經改名為Wire.read()。

source: As of Arduino 1.0, the Wire.receive() function was renamed to Wire.read() for consistency with other libraries.
de: Seit Arduino 1.0 wurde die Funktion Wire.receive() wegen der Übereinstimmung mit anderen Librarys zu Wire.read() umbenannt.
zh_tw: 從Arduino 1.0開始，Wire.receive()函式已經改名為Wire.read()，以便與其他程式庫保持一致。

source: Console Error
de: Konsolenfehler
zh_tw: 主控台錯誤

source: A problem occurred while trying to open the files used to store the console output.
de: Ein Problem ist aufgetreten, während versucht wurde, die Datei zum Speichern der Konsolenausgabe zu öffnen.
zh_tw: 試著開啟用來儲存主控台輸出的檔案時，發生問題。

source: Non-fatal error while setting the Look & Feel.
de: Nicht ernsthafter Fehler beim Setzen des Look & Feel
zh_tw: 設定外觀&感覺時發生非嚴重性的錯誤

source: The error message follows, however Arduino should run fine.
de: Die Fehlermeldung folgt, trotzdem sollte der Arduino normal funktionieren.
zh_tw: 底下會有錯誤訊息，但Arduino應該還是可以正常運作

source: Problem Setting the Platform
de: Problem beim Setzen der Plattform
zh_tw: 設定平台時發生問題

source: An unknown error occurred while trying to load platform-specific code for your machine.
de: Es ist ein unbekannter Fehler aufgetreten, während versucht wurde, plattform-spezifischen Code für Ihren Computer auszuführen.
zh_tw: 試著為你的機器載入與平台相關的程式碼時時， 發生未知錯誤。

source: Please install JDK 1.5 or later
de: Bitte installieren Sie JDK 1.5 oder neuer
zh_tw: 請安裝JDK 1.5（或更新的版本）

source: Arduino requires a full JDK (not just a JRE) to run. Please install JDK 1.5 or later. More information can be found in the reference.
de: Arduino benötigt eine komplette JDK (nicht nur eine JRE), um zu funktionieren. Bitte installieren Sie JDK 1.5 oder neuer. Weitere Informationen finden Sie in der Referenz.
zh_tw: 執行Arduino需要完整的JDK（不僅是JRE）， 請安裝JDK 1.5（或更新的版本）。 更多資訊可在參考文件裡找到。

source: Sketchbook folder disappeared
de: Der Sketchbook-Ordner ist verschwunden
zh_tw: 草稿碼簿目錄不見了

source: The sketchbook folder no longer exists. Arduino will switch to the default sketchbook location, and create a new sketchbook folder if necessary. Arduino will then stop talking about himself in the third person.
de: Der Sketchbook-Ordner existiert nicht mehr. Arduino wird nun den Standard Sketchbook-Speicherort verwenden und wird einen neuen Sketchbook-Ordner erstellen, wenn notwendig. Arduino wird dann aufhören, über sich in der dritten Person zu reden.
zh_tw: 草稿碼簿目錄不存在。 Arduino將改成預設的草稿碼簿的路徑， 若有需要會建立新的。 Arduino接下來將停止以第三人稱 討論它自己。

source: Time for a Break
de: Zeit für eine Pause
zh_tw: 該是休息一下的時刻囉

source: You've reached the limit for auto naming of new sketches for the day. How about going for a walk instead?
de: Sie haben das heutige Limit für das automatische Benennen von Sketchen erreicht. Wie wäre es mit einem Spaziergang?
zh_tw: 你今天已經達到自動命名草稿碼的數目上限了， 何不外出散散步呢？

source: Sunshine
de: Sonnenschein
zh_tw: 陽光

source: No really, time for some fresh air for you.
de: Nein wirklich, Zeit für ein bisschen frische Luft für Sie.
zh_tw: 不，我說真的，該是時候呼吸呼吸新鮮空氣了。

source: Open an Arduino sketch...
de: Einen Arduino Sketch öffnen...
zh_tw: 開啟Arduino草稿碼...

source: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Are you sure you want to Quit?</b><p>Closing the last open sketch will quit Arduino.
de: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Sind Sie sicher, dass Sie Arduino beenden möchten?</b><p>Das Schließen des letzten offenen Sketches beendet Arduino.
zh_tw: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>你確定要離開嗎？</b><p>關閉最後一份開啟中的草稿碼就回離開Arduino。

source: Contributed
de: Beigetragen
zh_tw: 貢獻

source: Sketch Does Not Exist
de: Sketch existiert nicht
zh_tw: 草稿碼不存在

source: The selected sketch no longer exists. You may need to restart Arduino to update the sketchbook menu.
de: Der ausgewählte Sketch existiert nicht mehr. Sie sollten Arduino neu starten, um das Sketchbook-Menü zu aktualisieren.
zh_tw: 被選的草稿碼已經不存在了。 你可能需要重新啟動Arduino， 以更新草稿碼簿的目錄。

source: The sketch "{0}" cannot be used. Sketch names must contain only basic letters and numbers (ASCII-only with no spaces, and it cannot start with a number). To get rid of this message, remove the sketch from {1}
de: Der Sketch "{0}" kann nicht verwendet werden. Sketchnamen dürfen nur normale Buchstaben und Zahlen (ausschließlich ASCII ohne Leerzeichen und ohne Zahl als erstes Zeichen) enthalten. Bitte löschen Sie diesen Sketch von {1}, um diese Meldung loszuwerden.
zh_tw: 這份草稿碼"{0}"無法使用。 草稿碼的名稱只能含有一般的字母與數字 （只能用ASCII，不能有空白，不能以數字開頭。） 若不想看到此訊息，請從{1}移除草稿碼。

source: Ignoring sketch with bad name
de: Ignoriere Sketch mit ungültigem Namen
zh_tw: 忽略名稱錯誤的草稿碼

source: The library "{0}" cannot be used. Library names must contain only basic letters and numbers. (ASCII only and no spaces, and it cannot start with a number)
de: Die Library "{0}" kann nicht verwendet werden. Librarynamen dürfen nur normale Buchstaben und Zahlen (ausschließlich ASCII ohne Leerzeichen und ohne Zahl als erstes Zeichen) enthalten.
zh_tw: 這份程式庫"{0}"無法使用。 程式庫的名稱只能含有一般的字母與數字 （只能用ASCII，不能有空白，不能以數字開頭。）

source: Ignoring bad library name
de: Ignoriere ungültigen Librarynamen
zh_tw: 忽略名稱錯誤的程式庫

source: Problem getting data folder
de: Problem beim Lesen des Datenordners
zh_tw: 取得資料目錄時發生問題

source: Error getting the Arduino data folder.
de: Fehler beim Lesen des Arduino Datenordners.
zh_tw: 取得Arduino資料目錄時發生錯誤

source: Settings issues
de: Fehler bei den Einstellungen
zh_tw: 設定問題

source: Arduino cannot run because it could not create a folder to store your settings.
de: Arduino konnte nicht gestartet werden, weil kein Ordner zum Speichern der Einstellungen erstellt werden konnte.
zh_tw: Arduino無法執行，因為它無法 建立儲存你的設定值的目錄。

source: You forgot your sketchbook
de: Sie haben Ihr Sketchbook vergessen
zh_tw: 你忘記你的草稿碼簿了

source: Arduino cannot run because it could not create a folder to store your sketchbook.
de: Arduino konnte nicht gestartet werden, weil kein Ordner zum Speichern des Sketchbooks erstellt werden konnte.
zh_tw: Arduino無法執行，因為它無法 建立儲存你的草稿碼簿的目錄。

source: Select (or create new) folder for sketches...
de: Einen Ordner für Sketches auswählen (oder neu erstellen)...
zh_tw: 選擇（或建立）存放草稿碼的目錄...

source: Problem Opening URL
de: Problem beim Öffnen der URL
zh_tw: 開啟URL時發生問題

source: Could not open the URL {0}
de: Die URL {0} konnte nicht geöffnet werden.
zh_tw: 無法開啟這個URL {0}

source: Problem Opening Folder
de: Problem beim Öffnen des Ordners
zh_tw: 開啟目錄時發生問題

source: Could not open the folder {0}
de: Der Ordner {0} konnte nicht geöffnet werden.
zh_tw: 無法開啟這個目錄 {0}

source: Message
de: Nachricht
zh_tw: 訊息

source: Warning
de: Warnung
zh_tw: 警告

source: Could not remove old version of {0}
de: Alte Version von {0} konnte nicht gelöscht werden
zh_tw: 無法移除{0}的舊版

source: Could not replace {0}
de: {0} konnte nicht ersetzt werden
zh_tw: 無法取代{0}

source: Could not delete {0}
de: {0} konnte nicht gelöscht werden
zh_tw: 無法刪除{0}

source: New Tab
de: Neuer Tab
zh_tw: 新增標籤

source: Rename
de: Umbenennen
zh_tw: 重新命名

source: Previous Tab
de: Vorheriger Tab
zh_tw: 上一個標籤

source: Next Tab
de: Nächster Tab
zh_tw: 下一個標籤

source: Verify
de: Überprüfen
zh_tw: 驗證

source: Open
de: Öffnen
zh_tw: 開啟

source: New Editor Window
de: Neues Editorfenster
zh_tw: 新編輯器視窗

source: Open in Another Window
de: In einem neuen Fenster öffnen
zh_tw: 以另一個視窗開啟

source: No launcher available
de: Kein Starter verfügbar
zh_tw: 沒有啟動者

source: Unspecified platform, no launcher available. To enable opening URLs or folders, add a "launcher=/path/to/app" line to preferences.txt
de: Unspezifizierte Plattform, kein Starter verfügbar. Um das Öffnen von URLs oder Ordnern zu aktivieren, fügen Sie bitte die Zeile "launcher=/path/to/app" in der preferences.txt hinzu.
zh_tw: 沒有指定平台，沒有啟動者。 若要開啟URL或目錄，請在preferences.txt加入這一行： "launcher=/path/to/app"。

source: Could not read color theme settings. You'll need to reinstall Processing.
de: Farbschema-Einstellungen konnten nicht gelesen werden. Sie sollten Arduino neu installieren.
zh_tw: 無法讀取色彩佈景主題的設定。 你需要重新安裝Processing。

source: Browse
de: Durchsuchen
zh_tw: 瀏覽

source: Catalan
de: Català

source: Chinese Simplified
de: 大陆简体

source: Danish
de: Dansk

source: Dutch
de: Nederlands

source: French
de: Français

source: Filipino
de: Pilipino

source: Galician
de: Galego

source: German
de: Deutsch

source: Greek
de: ελληνικά

source: Hungarian
de: Magyar

source: Italian
de: Italiano

source: Japanese
de: 日本語

source: Latvian
de: Latviešu Valoda

source: Persian
de: فارسی

source: Romanian
de: Limba Română

source: Spanish
de: Español

source: Could not read default settings. You'll need to reinstall Arduino.
de: Standardeinstellungen konnten nicht gelesen werden. Sie müssen Arduino neu installieren.
zh_tw: 無法讀取預設設定， 你需要重新安裝Arduino

source: Could not read preferences from {0}
de: Einstellungen konnten nicht aus {0} gelesen werden.
zh_tw: 無法從{0}讀取偏好設定

source: Error reading preferences
de: Fehler beim Lesen der Einstellungen
zh_tw: 讀取偏好設定時發生錯誤

source: Error reading the preferences file. Please delete (or move) {0} and restart Arduino.
de: Fehler beim Lesen der Einstellungs-Datei. Bitte löschen (oder verschieben) Sie {0} und starten Sie Arduino neu.
zh_tw: 讀取偏好設定檔時發生錯誤，請刪除（或移動） {0}並且重新啟動Arduino

source: Sketchbook location:
de: Sketchbook Speicherort:
zh_tw: 草稿碼簿的位置：

source: Select new sketchbook location
de: Neuen Sketchbook Speicherort auswählen
zh_tw: 選擇新的草稿碼簿位置

source: (requires restart of Arduino)
de: (benötigt einen Neustart von Arduino)
zh_tw: （需要重新啟動Arduino）

source: Editor font size:
de: Editor Schriftgröße:
zh_tw: 編輯器字型大小：

source: Show verbose output during:
de: Ausführliche Ausgabe anzeigen während:
zh_tw: 顯示詳細輸出：

source: compilation
de: Kompilierung
zh_tw: 編譯

source: Verify code after upload
de: Code nach Upload überprüfen

source: Use external editor
de: Externen Editor benutzen
zh_tw: 使用外部編輯器

source: Check for updates on startup
de: Beim Starten nach Updates suchen
zh_tw: 在啟動時檢查更新

source: Update sketch files to new extension on save (.pde -> .ino)
de: Sketchdateien beim Speichern zu neuer Dateiendung aktualisieren (.pde -> .ino)
zh_tw: 儲存時更新草稿碼檔案的附檔名（.pde -> .ino）

source: Automatically associate .ino files with Arduino
de: .ino-Dateien automatisch mit Arduino verknüpfen
zh_tw: 自動將.ino檔案與Arduino關聯起來

source: More preferences can be edited directly in the file
de: Mehr Einstellungen können direkt in der Datei geändert werden
zh_tw: 在偏好設定檔案裡還有更多的設定值，可以直接編輯

source: (edit only when Arduino is not running)
de: (nur bearbeiten, wenn Arduino nicht gestartet ist)
zh_tw: （只能在不執行Arduino時進行編輯）

source: ignoring invalid font size {0}
de: Ignoriere ungültige Schriftgröße {0}
zh_tw: 忽略無效的字型大小{0}

source: Sketchbook
zh_tw: 草稿碼簿

source: Upload
zh_tw: 上傳

source: Sketch
zh_tw: 草稿碼

source: Tools
zh_tw: 工具

source: Serial Monitor
zh_tw: 序列埠監控視窗

source: Board
zh_tw: 板子

source: Programmer
zh_tw: 燒錄器

source: OK
zh_tw: 好

source: Update
zh_tw: 更新

source: baud
zh_tw: 傳輸鮑率

source: environment
zh_tw: 環境

source: upload
zh_tw: 上傳
